server/performance/artillery.base.yml
# ==============================================================================
# artillery.base.yml — Shared base configuration for all performance tests
# ==============================================================================
#
# This file is NOT run directly. Individual test files import ("extend") it
# so they inherit the target URL, default headers, and reporting plugins.
#
# How to use:
#   Each test YAML file under tests/ starts with:
#     config:
#       target: "http://localhost:8081"   ← override here if your port differs
#
# Artillery concepts:
#   phases       → define how many virtual users arrive over time
#   arrivalRate  → new users per second added during this phase
#   rampTo       → linearly ramp arrivals up to this rate by end of phase
#   duration     → how long (seconds) that phase lasts
#   maxVusers    → hard cap on concurrent virtual users (optional safety limit)
# ==============================================================================

config:
  # ── Base URL ──────────────────────────────────────────────────────────────
  # Change to your staging/production URL when running against those environments.
  target: "http://localhost:5000"

  # ── Default HTTP headers sent with every request ─────────────────────────
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # ── Shared load phases (referenced by test files as a starting template) ─
  # Phase 1 – Warm-up:  5 users/sec for 20 s — lets the server stabilise
  # Phase 2 – Ramp-up: linearly grow from 5 → 30 users/sec over 40 s
  # Phase 3 – Sustain: hold at 30 users/sec for 60 s — this is the real test
  phases:
    - name: "Warm-up"
      duration: 20
      arrivalRate: 5

    - name: "Ramp-up"
      duration: 40
      arrivalRate: 5
      rampTo: 30

    - name: "Sustained load"
      duration: 60
      arrivalRate: 30

  # ── Plugins ───────────────────────────────────────────────────────────────
  # artillery-plugin-metrics-by-endpoint groups stats PER URL so you can see
  # which specific route is slow, not just an overall average.
  # Install: npm install --save-dev artillery-plugin-metrics-by-endpoint
  plugins:
    metrics-by-endpoint: {}

  # ── Reporting ─────────────────────────────────────────────────────────────
  # Artillery prints a summary table after every test.
  # Key metrics to watch:
  #   http.response_time.mean   → average latency (ms)
  #   http.response_time.p95    → 95th-percentile latency (ms)
  #   http.request_rate         → requests per second
  #   http.codes.*              → count of HTTP status codes returned
  #   vusers.failed             → virtual users that hit an error